[
  {
    "path": "posts/2021-08-24-dashboards-and-reports/",
    "title": "Discussions around dashboards versus reports",
    "description": "Much of our analysis output is either in a report form or a dashboard, sometimes both. This discussion was to understand people's experiences, preferences and any difficulties they encounter.",
    "author": [
      {
        "name": "Zoë Turner",
        "url": "https://twitter.com/Letxuga007"
      }
    ],
    "date": "2021-08-24",
    "categories": [
      "Outcomes",
      "Outputs"
    ],
    "contents": "\n\nContents\nHOPE (Health Outcomes and Patient Experience)\nReplication and cross-over\nCommunication\nWho drives the analysis?\nPurpose\nConclusion\n\nWe didn’t have quite the mix of users to the group as we’ve had in other groups but we had representatives from the CDU Data Science Team, Applied Information, Performance and Research which was still very useful to share our experiences of producing outputs like dashboards and reports.\nThe creation of dashboards has been successful within the Applied Information team and works well when designed for a key customer who is often also the data owner. The process of dashboard creation has been iterative and there has been a lot of engagement as a result. Often the dashboards have been designed to display all the charts on one screen which is slightly different to the dashboards produced by the CDU Data Science team, including the Patient Experience dashboard, which has multiple pages.\nHOPE (Health Outcomes and Patient Experience)\nAs I described the ideas around HOPE (Health Outcomes and Patient Experience), some of the feedback was that there is a potential of “over selling the data”, particularly around pulling in too much information. The same concerns were around multiple page reports. This resonated with one of the things I’d learned from a talk by David Spiegelhalter over the last year, which I shared with the group: he suggested having short headline analysis, followed by more detail for those who are interested, followed by thorough technical and detailed information aimed at those who are like us.1\nThe tendency I have had, in creating dashboards has been to both second guess what the end user would want and also apply what I would want, and my interest as an analyst is often much more detailed than others.\nReplication and cross-over\nBecause the CDU Data Science Team will be using and analysing information from HR, Clinical and Patient Experience there was concern expressed in any overlaps with existing reporting like ‘Ward to Board’ generated by the Applied Information team. This is a very important point it can be too easy to replicate the same work, just a slightly different way. We recognise that previous dashboards should not replicate current reporting and performance but more of an analysis as to the different data interacts For example, in the analysis between the staff survey and well being key messages came from the statistical analysis which was:\n\nAppraisal rates do not correlate with any of the ONS questions relating to well being.\nHow happy a person reports to be does not correlate with any of the HR proxy measures of workforce satisfaction.\nThere is a strong relationship between reporting feeling Anxious and Age Band, but this is not replicated by Directorate.\nThe HR proxy measures of Turnover and Sickness could be used as an ongoing measure of staff well being, which is only recorded on a yearly basis, due to the strong correlations to reporting feeling Satisfied or Worthwhile for Directorates and, to a less extent, by Age Band.\n\nDashboards, on the other hand, are a good way of monitoring processes over time.\nCommunication\nAny analysis should start with the question of what is it that you want to know. However, when designing dashboards, particularly for a general audience, the “what do you want to know” is guessed by the analyst. There were discussions about how empowered various colleagues may, or may not be, in asking for what they want, correcting us if we interpret that incorrectly and feel comfortable questioning our methods or results.\nA question was posed, “Do we ever go through the data with the requester?” or do we or the requesters expect “answers to just jump out?”. Personally, I would say yes, I’ve erroneously expected others to see what I see with data requests/visualisations. Likewise, I have equally been on the receiving end of receiving data that hasn’t been analysed and whilst I love data and numbers, I feel overwhelmed by tables of numbers as they require contemplation (and often benefit from visualisations). Nothing from a table of numbers “jumps out at me”.\nWho drives the analysis?\nDashboards that have worked well from Applied Information have been when the main “driver” has been outside the team rather than “we think” this is what is required. It can be hard, as an analyst, not to apply your own thinking and curiosity to dashboards for things that may not be as relevant or useful to others.\nOther things to consider are how long a dashboard is useful for.\nPurpose\nThe purpose of a dashboard is often for discovery. There was some honest feedback (from analysts!) that there can be fear of breaking anything when just selecting options. Often the feeling is that once things are set up, it’s best to leave it like that in case we can’t get back to it. This is indicative of the complexity, perhaps, of some dashboards.\nConclusion\nThis was a great discussion between analysts, one which we rarely get to have, but would no doubt benefit greatly from having others input into, particularly end users/customers. Consequently, we will revisit this discussion again.\n\nI tried finding the talk I heard this in but it’s harder to locate references in talks than I realised! I also found I got distracted as the talks are really good so I’d recommend searching and watching talks by David Spiegelhalter for more information on how to communicate statistics effectively.↩︎\n",
    "preview": "posts/2021-08-24-dashboards-and-reports/img/flowers.jpg",
    "last_modified": "2021-10-12T18:48:04+00:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-07-28-collecting-data-and-reporting-through-mhsds/",
    "title": "Collecting data and reporting through MHSDS",
    "description": "Discussions started with how gender identity is currently collected, how this is affected by a National Return and how we need to document how to escalage apparent mistakes in data appropriately.",
    "author": [
      {
        "name": "Zoë Turner",
        "url": "https://twitter.com/Letxuga007"
      }
    ],
    "date": "2021-07-28",
    "categories": [
      "National Returns",
      "Collecting data",
      "Gender Identity"
    ],
    "contents": "\n\nContents\nCollecting gender and sex information\nMHSDS flows\n\nData Quality\n\nCollecting gender and sex information\nAt the July meeting of Understanding Your Data the group was updated on some discussions that have been had around the collection of gender identity information. Currently, particularly for the Mental Health clinical system, data is collected for Gender as determined by the NHS Data Dictionary and which feeds into the National Return MHSDS. This information is collected in the front page of RIO which is the same for all organisations that use it. Whilst we can set the pick lists, we would have to put in a request to change/add/delete the questions and this would have to apply nationally.\nGender identity, pronouns and titles are of increasing importance to patients and this data, if recorded with consent, is not collected in the same places across the teams. There are also other systems where this is also of consideration both clinical and for employees. The LGBT Foundation and NHS England hosted a webinar on the subject of “If you’re not counted, you don’t count!” and whilst the data around LGB can be better collected, there is a specific place in the clinical systems for this.\nApplied Information updated the group that the current MHSDS v4.0 will be updated by the end of the year to v5.0 which will result in a new category list for gender identity.\nMHSDS flows\nWe discussed the possibility of changing the category pick list now, which is possible but this would not flow to MHSDS as the categories that are new to the return would be rejected.\nForms have been set up in other parts of RIO to show a pick list to users that is useful but is mapped in the background to the MHSDS categories which were deemed more restrictive. However, in this case there would be no mapping for Non-binary and Other (not listed).\nData Quality\nWe discussed where data doesn’t seemingly correspond in gender, for example a male name but with Mrs as a title could be a data entry error. Raising these issues could, possibly, highlight a person being transgender or non-binary without their consent and, particularly when looking at different clinical systems, could be a deliberate choice in selection of differing genders.\nThis has occurred for the patient survey which uses Titles and on 2 occasions these were checked with the lead clinician for the referral. On both occasions there was a delay in response due to workload so the National Spine was used ultimately for the purpose of the survey.\nThrough analysis we often find data quality errors like dates of birth being the same as the referral date as they were unknown, generic or same dates for cultural reasons. We also noted that for some services where details are unknown, some names are created as a requirement of the system and these often follow a format like John Doe, Jane Doe or phonetic names like Alpha, Beta, Charlie and so on. However, not all analysts look at names, only the ids of patients and service information so these would not be highlighted or corrected.\nWe discussed where data quality issues could be raised appropriately and we agreed that a Standard Operating Procedure would be really useful for analysts. We acknowledged that this may vary according to data and also by teams and getting input from teams across the organisation, including general health teams, would be required. One way to do this is to open up any documentation to access through the Intranet.\n\n\n\n",
    "preview": "posts/2021-07-28-collecting-data-and-reporting-through-mhsds/img/flying-dandelions.png",
    "last_modified": "2021-10-12T18:48:04+00:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-04-ordering-graphs-by-geographyteam/",
    "title": "Ordering graphs by geography/team",
    "description": "Discussion around how best to show graphical data when referring to teams that cover a geographical area like Nottinghamshire.",
    "author": [
      {
        "name": "Lori Edwards Suárez",
        "url": "https://twitter.com/Lori_E_S_"
      }
    ],
    "date": "2021-06-04",
    "categories": [
      "Visualisations",
      "Geography"
    ],
    "contents": "\nTypically, when organising teams onto a graphs/tables and other formats they default to alphabetical. However, during a recent Understanding Your Data meeting we discussed was this the most useful way to present data.\nWithin Nottinghamshire we have the geography broken down into 4 key areas. From north to south we have Bassetlaw, Mid Notts, County South and City. When sorted alphabetically they would be Bassetlaw, City, County South and Mid Notts. The Crisis Resolution, Home Treatment (CRHT) teams map directly to these localities. When creating graphs and tables they would have been alphabetical. As seen in the graph below it can show a large discrepancy between Bassetlaw and City (Numbers removed from y-axis for public showing). When the reality is that the two populations are as different as can be within Nottinghamshire. Bassetlaw is very rural and less deprived compared to Nottingham.\nFacetted graph of Crisis team referrals by day of week, the order is by alphabet: Bassetlaw, City, City South and Mid NottsThis then triggered the consideration about the most appropriate way to order the teams. As the teams are most like each other are those that are geographically neighbouring. While there are still differences between each geography it allows for some consideration between them. When organised differently the large difference between Bassetlaw and City is less distracting and allows for them to be assessed more truly.\nSame chart as before but reordered by geography, Bassetlaw, Mid Notts, County South and City.It was discussed in the meeting and the view from the clinicians’ present, as well as other members of the group, is that this did fit more logically to how they associate the teams. For CRHT City and County South are co-located in the same physical location so are often thought of together, Mid Nottinghamshire and Bassetlaw share a service manager as well as offering support out of hours for each other. Since this discussion it has been discussed with other areas such as older adult community teams who preferred the geographical ordering. Within Mid Nottinghamshire there are 2 older adult teams. “Ashfield & Mansfield” and “Newark & Sherwood”, when ordered with the other 5 community teams they were top and bottom of the list making it hard to compare them when they are the teams expected to be most similar to each other. Bassetlaw and Nottingham City were again placed next to each other in the ordering alphabetically causing them to see very different, even though a lot of the difference is commonly relating to the difference in population rather than team performance.\n\n\n\n",
    "preview": "posts/2021-06-04-ordering-graphs-by-geographyteam/img/poppy.png",
    "last_modified": "2021-10-12T18:48:04+00:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-06-may-2021-meeting/",
    "title": "May 2021 Meeting",
    "description": "A summary of the discussions at the May Meeting, the frustrations, challenges and considerations of data",
    "author": [
      {
        "name": "Zoë Turner",
        "url": "https://twitter.com/Letxuga007"
      }
    ],
    "date": "2021-05-06",
    "categories": [
      "HoNOS",
      "Training"
    ],
    "contents": "\n\nContents\nHoNOS (Health of the Nation Outcome Scales)\nAnalyst input - using Excel\nTraining\nAn analytical approach\nAutomate\nOverall themes\nMore information\n\nIt’s a great misconception that there are “data people” and there are “non-data people” as everyone is a “data person” so long as that data is relevant to them or their work. Whilst you may not necessarily feel you are a “data person”, it’s often the case that when presented with something that is relevant and incorrect, it’s noticed, even if it’s not possible to explain why. It’s in this context that the success of the Understanding Your Data meetings lies as, whilst people have been coming due to an interest in data, the themed discussions often were similar or very closely related. At the last Understanding Your Data meeting in particular, we discussed some frustrations, challenges and concerns around data in the context of two particular subject areas: HoNOS and incident data.\nHoNOS (Health of the Nation Outcome Scales)\nTo explain HoNOS further for context:\nHoNOS (Health of the Nation Outcome Scales)\n\nThe MHCT has been developed in partnership between the Department of Health, the Royal College of Psychiatrists Centre for Advanced Learning and Conferences and the Care Pathways and Packages Project (CPPP) as a means of allocating clients to Care Clusters which in turn supports care planning and enables Mental Health Payment by Results (MH PbR).\nHoNOS was published by the Royal College of Psychiatrists (RCPsych) in 1996 and is now the most widely used outcome measure in specialist mental health services in England and overseas.\n\nis collected throughout many of our mental health services, but we discussed where there will be gaps in this data collection; some services see patients only briefly in the service before being referred onto other services so HoNOS is not collected, also there are differences in how analysts and clinicians use the data as there are rules around Payment By Results (PbR) which mean the data we, analysts, see differs. This is of great importance to the CDU Data Science Team as we are building a package to analyse and visualise the HoNOS data and this domain knowledge helps to inform our understanding and the limitations of any analysis we do.\nAnalyst input - using Excel\nThe other discussions we had, which stemmed from incident data, covered a lot of other general data and analytical points. We started with a discussion on the requirement for analysis and how the particular team requesting needing this used to have a dedicated analyst who brought to the role their domain knowledge as well as analytical expertise. This led to a discussion that covered a bit of what we covered previously in that Excel spreadsheets is a very commonly used tool within the Trust; for many it is often the default tool from teams to senior management.\nSometimes spreadsheets can just “stop working” as intended and it’s these scenarios where the solution of training courses is not really a solution. Courses get people started in using a tool, but to really master any tool, it requires repeated use, and for Excel as well as analysis, this is not the main responsibility for many staff. Knowing who to talk to about problems with spreadsheets or how to analyse things was a common frustration.\nTraining\nNottinghamshire Healthcare NHS Foundation Trust do offer training in Microsoft Office programs and details can be found through the Intranet pages.\nFor programming in R and R Studio NHS-R Community do free training for anyone in the public sector on the introduction to R and R Studio. This is run by Zoë Turner in CDU Data Science Team so if a team is in interested in this it a specific course in the Trust can be set up. Course materials are available here.\nAn analytical approach\nSome things that were discussed and that will resonate with analysts are that:\nWhat people ask for in terms of data, may not necessarily be what they want. Often the requests need to be translated or redirected. For example, someone may ask for data by month but because months vary in size it may be better by week. Weeks too need to be determined by what day they start from, is it Monday or is it Sunday? Lori Edwards Suárez from the CDU Data Science Team has written more on this and has also helped with Data Clinics.\nData is complex and some colleagues specifically will not analyse anything they have not asked for this reason. These are colleagues who, when they request data, are very detailed and precise in their requests.\nThere is a good understanding of how time periods on data extractions can have a significant impact on analysis.\nGratefulness was expressed for all data that is entered.\nDashboards need to include the following information:\nwhere the data is from\nthe parameters of the data\nwhen was it extracted\nany caveats to the data, inclusions/exclusions for example\ntimeliness in data, is this data refreshed regularly?\n\nAcknowledgement of how whilst querying why “one number is different to another”, it is an unnecessary distraction in meetings where this is not the purpose of the meeting. One solution that works for colleagues is to use a data extract and not refresh this until all queries are resolved. This highlights the need for fixed reports and extracts as dashboards are often refreshed daily and so numbers will change and make it harder to resolve queries.\nAutomate\nWe also discussed how, if you do something twice then it needs automating but this poses problems for those who are not analysts working with data every day as:\nyou need to have the tools to automate\nyou need to have the skills to automate\nyou need to know when automation is possible\nOverall themes\nTwo other points where we are all data people are that we all:\nAsk ourselves - do I trust this?\nFeel immense frustration when things don’t work first time, consistently and in a way that we expect.\nConsequently, any organisation needs to consider the following in terms of data use and support for analysis:\nRESOURCE - who is available to do the data cleaning, analysis and understanding. This is often the area of analysts and data scientists but their focus is often directed to specific areas like clinical, HR, or finance. Some data falls outside of these specialisms and accessing support or advice can be difficult.\nMETHODOLOGY - all data needs to be provided with caveats, “context”, information on the information.\nTRUST - in the data is paramount and this must come from an open and transparent way of working.\nCONTEXT - it must be acknowledged that some people require fixed reports, whilst others want their data straight from a system and so may require dashboards or direct access. The reasons for data requests are based in the context and any analysis must relate to that.\nMore information\nFor more information on the Understanding Your Data initiative please go to the main page and feel free to contact members of the CDU Data Science Team by email or through social media].\n\n\n\n",
    "preview": "posts/2021-05-06-may-2021-meeting/img/lavender.jpg",
    "last_modified": "2021-10-12T18:48:04+00:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-04-07-april-2021-meeting/",
    "title": "April 2021 Meeting",
    "description": "CDU Data Science Roadmap and a summary of the topics discussed in this month's meeting.",
    "author": [
      {
        "name": "Zoë Turner",
        "url": "https://twitter.com/Letxuga007"
      }
    ],
    "date": "2021-04-07",
    "categories": [
      "Training",
      "Public Health",
      "CDU Data Science Team",
      "Maps",
      "Data Clinics",
      "Patient Feedback"
    ],
    "contents": "\n\nContents\nCDU Data Science Roadmap\nThemes from the events\nTraining\nR and R Studio\n\nMapping\nPublic Health Mapping tools\n\nData clinics\nPatient Feedback\n\n\nCDU Data Science Roadmap\nThe video of the presentation by Chris Beeley is viewable in on the Trust’s Microsoft Stream site: https://web.microsoftstream.com/video/41df2da8-eac3-4391-8e0c-a4ef0a853688?list=studio (will require an authorised log in).\nhttps://cdu-data-science-team.github.io/presentations/2021-03-01%20CDU%20Data%20Science%20Team%20Roadmap/roadmap.html#1\n\n\nfitvids('.shareagain', {players: 'iframe'});More information on the team and what we do was presented by Milan Wiedemann. Slides are here.\nThemes from the events\nTraining\nTraining was something we hadn’t considered but came up as a theme. Analysts main software tools are Excel, PowerBI, SQL and R.\nR and R Studio\nNottinghamshire Healthcare NHS Foundation Trust allows all staff to access R and R Studio for download through the Software Centre (accessible through the Windows Start button).\nTraining is offered through NHS-R Community every month. The course is led by Zoë Turner. Course materials are available here.\nShiny training is being offered through NHS-R Community and is being designed and led by Chris Beeley. Course materials are available here and specifically for beginners.\nHelp for R can be sought from the Slack channel nhsrcommunity.slack.com. Also note that there is a Government Data Science Slack channel govdatascience.slack.com but access to this is restricted to certain email addresses like nhs.net and not individual Trust accounts.\nMapping\nAnother general interest that came from the group was mapping data and tools used for this are often QGIS. This is also available through the Software Centre but specific access may be required through IT.\nPublic Health Mapping tools\nThere are a couple of Public Health mapping tools that are available and more information can be found here.\nData clinics\nSome individual pieces of work have come out of the Understanding your data meeting and have moved into the data clinic initiative discussed more here\nPatient Feedback\nNottinghamshire Healthcare NHS Foundation Trust’s Patient Feedback (including Care Opinion information) can be found here.\n\n\n\n",
    "preview": "posts/2021-04-07-april-2021-meeting/img/willow-catkin.png",
    "last_modified": "2021-10-12T18:48:04+00:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-03-initial-meeting/",
    "title": "Initial Meeting",
    "description": "Communications which were used to promote the purpose of the meetings.",
    "author": [
      {
        "name": "Zoë Turner",
        "url": "https://twitter.com/Letxuga007"
      }
    ],
    "date": "2021-02-03",
    "categories": [
      "Communications"
    ],
    "contents": "\n\nContents\nInitial communication\nStaff Notices\n\nInitial communication\nThe following is the initial communication shared through John Brewin, Chief Executive of Nottinghamshire Healthcare’s NHS Foundation Trust, daily emails.\nAre you interested in understanding your data better?\nDo you have questions about what is going on in your service you feel like you currently can’t answer?\nDo you have ideas for ways of presenting and understanding data that you don’t have the time to make a reality?\nWould you be interested in looking at data, analyses, and dashboards and feeding back your opinions about them?\nApplied Information and the Clinical Development Unit work together to collate, process, and analyse all sorts of datasets for national reporting as well as internal analysis, audit, evaluation, and research. We are trying to make sense of the data in the Trust but we need to hear from people out in services who can tell us what they want and don’t want, and can look at analytic products that we make and give us feedback on them.\nIf you’re interested in being a part of the way that the Trust develops its tools for analysing data there are lots of ways you can be involved- coming to a workshop, testing tools in your own time and feeding back your opinions, coming with your own ideas about tools or analyses you would like to see or just commenting on our plans and helping to shape the future of what we produce.\nStaff Notices\nThe following has been posted on the Staff Notices on the Nottinghamshire Healthcare’s NHS Foundation Trust’s Intranet:\n\nThe next Understanding Your Data meeting for those interested in “understanding your data” will be Friday 4 June from 11.30am to 12.30pm. This was started in response to our need to ensure that the solutions we create are understood by everyone and that we are concentrating on the right problems.\n\n\nThis will be a continuous two-way discussion facilitated by the CDU Data Science Team and will also include analysts from Applied Information and Performance and everyone is welcome, please contact zoe.turner2@nottshc.nhs.uk to join this virtual meeting and/or for more information. Also see our website with information https://cdu-data-science-team.github.io/team-blog/uyd.html\n\n\n\n\n",
    "preview": "posts/2021-02-03-initial-meeting/img/leaves.png",
    "last_modified": "2021-10-12T18:48:04+00:00",
    "input_file": {}
  }
]
